Формы22/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <attributes>
    <name>ПроектСогласован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеПроекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДляСогласования</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Формы22/src/Catalogs/Проекты/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Исполнители.Количество() > 1 И Объект.ПроектСогласован Тогда
		НесколькоИсполнителей = Истина;	
	КонецЕсли;
	Попытка
		Исполнитель = Объект.Исполнители[0].Сотрудник; 
	Исключение
		
	КОнецПопытки;
	ОбновитьПоляСогласования();
КонецПроцедуры

&НаКлиенте
Процедура ПроектСогласованПриИзменении(Элемент)
	ОбновитьПоляСогласования()
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоляСогласования()
	СогласованиеПроекта = Объект.ПроектСогласован;
	Если Не СогласованиеПроекта Тогда
		НесколькоИсполнителей = Ложь;
		НесколькоИсполнителейПриИзмененииНаСервере();
	КонецЕсли;
	Элементы.Исполнитель.Видимость = Не НесколькоИсполнителей;
	Элементы.НесколькоИсполнителей.Видимость = СогласованиеПроекта;
	Элементы.Руководитель.ОтметкаНезаполненного = СогласованиеПроекта;
	Элементы.Исполнитель.ОтметкаНезаполненного = СогласованиеПроекта;	
		
КонецПроцедуры

&НаКлиенте
Процедура НесколькоИсполнителейПриИзменении(Элемент)
	НесколькоИсполнителейПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НесколькоИсполнителейПриИзмененииНаСервере()
	Элементы.ГруппаИсполнители.Видимость = НесколькоИсполнителей;
	Элементы.Исполнитель.ОтметкаНезаполненного = НЕ НесколькоИсполнителей;
	Элементы.Исполнитель.Видимость = НЕ НесколькоИсполнителей;	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	Если Объект.Исполнители.Количество() > 0 Тогда
		Объект.Исполнители[0].Сотрудник = Исполнитель;
	Иначе
		Стр = Объект.Исполнители.Добавить();
		Стр.Сотрудник = Исполнитель;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.ПроектСогласован И НЕ НесколькоИсполнителей Тогда
		ПроверяемыеРеквизиты.Добавить("Исполнитель");

	КонецЕсли;
	
КонецПроцедуры
